; domain
(define (domain zeno-travel)
(:requirements :typing :negative-preconditions)
(:types aircraft person city flevel - object)
(:predicates (at ?x - person  ?c - city )
             (at_aircraft ?x - aircraft ?c - city)
             (in ?p - person ?a - aircraft)
	         (fuel-level ?a - aircraft ?l - flevel)
	         (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at_aircraft ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at_aircraft ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at_aircraft ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))
)

; problem
(define (problem ZTRAVEL-5-30)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at_aircraft plane1 city5)
	(fuel-level plane1 fl3)
	(at_aircraft plane2 city0)
	(fuel-level plane2 fl6)
	(at_aircraft plane3 city1)
	(fuel-level plane3 fl4)
	(at_aircraft plane4 city9)
	(fuel-level plane4 fl6)
	(at_aircraft plane5 city5)
	(fuel-level plane5 fl3)
	(at person1 city3)
	(at person2 city2)
	(at person3 city9)
	(at person4 city8)
	(at person5 city7)
	(at person6 city5)
	(at person7 city3)
	(at person8 city5)
	(at person9 city1)
	(at person10 city5)
	(at person11 city8)
	(at person12 city9)
	(at person13 city3)
	(at person14 city8)
	(at person15 city6)
	(at person16 city4)
	(at person17 city9)
	(at person18 city0)
	(at person19 city2)
	(at person20 city7)
	(at person21 city6)
	(at person22 city2)
	(at person23 city1)
	(at person24 city3)
	(at person25 city6)
	(at person26 city0)
	(at person27 city4)
	(at person28 city8)
	(at person29 city2)
	(at person30 city7)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at_aircraft plane4 city5)
	(at person1 city6)
	(at person2 city2)
	(at person3 city3)
	(at person4 city9)
	(at person5 city1)
	(at person6 city0)
	(at person7 city8)
	(at person8 city0)
	(at person9 city0)
	(at person10 city3)
	(at person11 city7)
	(at person12 city9)
	(at person13 city9)
	(at person14 city7)
	(at person15 city4)
	(at person16 city9)
	(at person17 city2)
	(at person18 city8)
	(at person19 city9)
	(at person20 city5)
	(at person21 city3)
	(at person22 city3)
	(at person23 city7)
	(at person24 city5)
	(at person25 city2)
	(at person26 city7)
	(at person27 city6)
	(at person28 city7)
	(at person29 city0)
	(at person30 city7)
	))

)

; plan
1. (fly plane5 city5 city0 fl3 fl2)
   deleted: (at_aircraft plane5 city5) (fuel-level plane5 fl3)
   added: (at_aircraft plane5 city0) (fuel-level plane5 fl2)
   goals met: 3 of 31
2. (board person26 plane5 city0)
   deleted: (at person26 city0)
   added: (in person26 plane5)
   goals met: 3 of 31
3. (board person18 plane5 city0)
   deleted: (at person18 city0)
   added: (in person18 plane5)
   goals met: 3 of 31
4. (fly plane5 city0 city8 fl2 fl1)
   deleted: (at_aircraft plane5 city0) (fuel-level plane5 fl2)
   added: (at_aircraft plane5 city8) (fuel-level plane5 fl1)
   goals met: 3 of 31
5. (board person4 plane5 city8)
   deleted: (at person4 city8)
   added: (in person4 plane5)
   goals met: 3 of 31
6. (board person28 plane5 city8)
   deleted: (at person28 city8)
   added: (in person28 plane5)
   goals met: 3 of 31
7. (debark person18 plane5 city8)
   deleted: (in person18 plane5)
   added: (at person18 city8)
   goals met: 4 of 31
8. (board person14 plane5 city8)
   deleted: (at person14 city8)
   added: (in person14 plane5)
   goals met: 4 of 31
9. (board person11 plane5 city8)
   deleted: (at person11 city8)
   added: (in person11 plane5)
   goals met: 4 of 31
10. (fly plane4 city9 city4 fl6 fl5)
   deleted: (at_aircraft plane4 city9) (fuel-level plane4 fl6)
   added: (at_aircraft plane4 city4) (fuel-level plane4 fl5)
   goals met: 4 of 31
11. (fly plane4 city4 city5 fl5 fl4)
   deleted: (at_aircraft plane4 city4) (fuel-level plane4 fl5)
   added: (at_aircraft plane4 city5) (fuel-level plane4 fl4)
   goals met: 5 of 31
12. (board person8 plane4 city5)
   deleted: (at person8 city5)
   added: (in person8 plane4)
   goals met: 5 of 31
13. (board person6 plane4 city5)
   deleted: (at person6 city5)
   added: (in person6 plane4)
   goals met: 5 of 31
14. (fly plane4 city5 city0 fl4 fl3)
   deleted: (at_aircraft plane4 city5) (fuel-level plane4 fl4)
   added: (at_aircraft plane4 city0) (fuel-level plane4 fl3)
   goals met: 4 of 31
15. (debark person8 plane4 city0)
   deleted: (in person8 plane4)
   added: (at person8 city0)
   goals met: 5 of 31
16. (debark person6 plane4 city0)
   deleted: (in person6 plane4)
   added: (at person6 city0)
   goals met: 6 of 31
17. (board person9 plane3 city1)
   deleted: (at person9 city1)
   added: (in person9 plane3)
   goals met: 6 of 31
18. (fly plane3 city1 city0 fl4 fl3)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl4)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl3)
   goals met: 6 of 31
19. (debark person9 plane3 city0)
   deleted: (in person9 plane3)
   added: (at person9 city0)
   goals met: 7 of 31
20. (board person10 plane1 city5)
   deleted: (at person10 city5)
   added: (in person10 plane1)
   goals met: 7 of 31
21. (fly plane4 city0 city5 fl3 fl2)
   deleted: (at_aircraft plane4 city0) (fuel-level plane4 fl3)
   added: (at_aircraft plane4 city5) (fuel-level plane4 fl2)
   goals met: 8 of 31
22. (fly plane5 city8 city7 fl1 fl0)
   deleted: (at_aircraft plane5 city8) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city7) (fuel-level plane5 fl0)
   goals met: 8 of 31
23. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 8 of 31
24. (board person5 plane5 city7)
   deleted: (at person5 city7)
   added: (in person5 plane5)
   goals met: 8 of 31
25. (debark person28 plane5 city7)
   deleted: (in person28 plane5)
   added: (at person28 city7)
   goals met: 9 of 31
26. (debark person26 plane5 city7)
   deleted: (in person26 plane5)
   added: (at person26 city7)
   goals met: 10 of 31
27. (board person20 plane5 city7)
   deleted: (at person20 city7)
   added: (in person20 plane5)
   goals met: 10 of 31
28. (debark person14 plane5 city7)
   deleted: (in person14 plane5)
   added: (at person14 city7)
   goals met: 11 of 31
29. (debark person11 plane5 city7)
   deleted: (in person11 plane5)
   added: (at person11 city7)
   goals met: 12 of 31
30. (fly plane1 city5 city2 fl3 fl2)
   deleted: (at_aircraft plane1 city5) (fuel-level plane1 fl3)
   added: (at_aircraft plane1 city2) (fuel-level plane1 fl2)
   goals met: 12 of 31
31. (board person29 plane1 city2)
   deleted: (at person29 city2)
   added: (in person29 plane1)
   goals met: 12 of 31
32. (board person22 plane1 city2)
   deleted: (at person22 city2)
   added: (in person22 plane1)
   goals met: 12 of 31
33. (board person19 plane1 city2)
   deleted: (at person19 city2)
   added: (in person19 plane1)
   goals met: 12 of 31
34. (fly plane1 city2 city3 fl2 fl1)
   deleted: (at_aircraft plane1 city2) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   goals met: 12 of 31
35. (board person7 plane1 city3)
   deleted: (at person7 city3)
   added: (in person7 plane1)
   goals met: 12 of 31
36. (board person24 plane1 city3)
   deleted: (at person24 city3)
   added: (in person24 plane1)
   goals met: 12 of 31
37. (debark person22 plane1 city3)
   deleted: (in person22 plane1)
   added: (at person22 city3)
   goals met: 13 of 31
38. (board person13 plane1 city3)
   deleted: (at person13 city3)
   added: (in person13 plane1)
   goals met: 13 of 31
39. (debark person10 plane1 city3)
   deleted: (in person10 plane1)
   added: (at person10 city3)
   goals met: 14 of 31
40. (board person1 plane1 city3)
   deleted: (at person1 city3)
   added: (in person1 plane1)
   goals met: 14 of 31
41. (fly plane5 city7 city1 fl1 fl0)
   deleted: (at_aircraft plane5 city7) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city1) (fuel-level plane5 fl0)
   goals met: 14 of 31
42. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 31
43. (debark person5 plane5 city1)
   deleted: (in person5 plane5)
   added: (at person5 city1)
   goals met: 15 of 31
44. (board person23 plane5 city1)
   deleted: (at person23 city1)
   added: (in person23 plane5)
   goals met: 15 of 31
45. (fly plane5 city1 city5 fl1 fl0)
   deleted: (at_aircraft plane5 city1) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city5) (fuel-level plane5 fl0)
   goals met: 15 of 31
46. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 15 of 31
47. (debark person20 plane5 city5)
   deleted: (in person20 plane5)
   added: (at person20 city5)
   goals met: 16 of 31
48. (fly plane5 city5 city7 fl1 fl0)
   deleted: (at_aircraft plane5 city5) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city7) (fuel-level plane5 fl0)
   goals met: 16 of 31
49. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 31
50. (debark person23 plane5 city7)
   deleted: (in person23 plane5)
   added: (at person23 city7)
   goals met: 17 of 31
51. (fly plane5 city7 city9 fl1 fl0)
   deleted: (at_aircraft plane5 city7) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city9) (fuel-level plane5 fl0)
   goals met: 17 of 31
52. (debark person4 plane5 city9)
   deleted: (in person4 plane5)
   added: (at person4 city9)
   goals met: 18 of 31
53. (fly plane1 city3 city0 fl1 fl0)
   deleted: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl0)
   goals met: 18 of 31
54. (fly plane2 city0 city2 fl6 fl5)
   deleted: (at_aircraft plane2 city0) (fuel-level plane2 fl6)
   added: (at_aircraft plane2 city2) (fuel-level plane2 fl5)
   goals met: 18 of 31
55. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 18 of 31
56. (debark person29 plane1 city0)
   deleted: (in person29 plane1)
   added: (at person29 city0)
   goals met: 19 of 31
57. (fly plane1 city0 city5 fl1 fl0)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city5) (fuel-level plane1 fl0)
   goals met: 19 of 31
58. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 31
59. (debark person24 plane1 city5)
   deleted: (in person24 plane1)
   added: (at person24 city5)
   goals met: 20 of 31
60. (fly plane1 city5 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city5) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 20 of 31
61. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 31
62. (debark person7 plane1 city8)
   deleted: (in person7 plane1)
   added: (at person7 city8)
   goals met: 21 of 31
63. (fly plane1 city8 city4 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city4) (fuel-level plane1 fl0)
   goals met: 21 of 31
64. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 21 of 31
65. (board person27 plane1 city4)
   deleted: (at person27 city4)
   added: (in person27 plane1)
   goals met: 21 of 31
66. (board person16 plane1 city4)
   deleted: (at person16 city4)
   added: (in person16 plane1)
   goals met: 21 of 31
67. (fly plane2 city2 city9 fl5 fl4)
   deleted: (at_aircraft plane2 city2) (fuel-level plane2 fl5)
   added: (at_aircraft plane2 city9) (fuel-level plane2 fl4)
   goals met: 21 of 31
68. (board person3 plane2 city9)
   deleted: (at person3 city9)
   added: (in person3 plane2)
   goals met: 21 of 31
69. (fly plane2 city9 city3 fl4 fl3)
   deleted: (at_aircraft plane2 city9) (fuel-level plane2 fl4)
   added: (at_aircraft plane2 city3) (fuel-level plane2 fl3)
   goals met: 21 of 31
70. (debark person3 plane2 city3)
   deleted: (in person3 plane2)
   added: (at person3 city3)
   goals met: 22 of 31
71. (fly plane2 city3 city6 fl3 fl2)
   deleted: (at_aircraft plane2 city3) (fuel-level plane2 fl3)
   added: (at_aircraft plane2 city6) (fuel-level plane2 fl2)
   goals met: 22 of 31
72. (board person25 plane2 city6)
   deleted: (at person25 city6)
   added: (in person25 plane2)
   goals met: 22 of 31
73. (fly plane2 city6 city2 fl2 fl1)
   deleted: (at_aircraft plane2 city6) (fuel-level plane2 fl2)
   added: (at_aircraft plane2 city2) (fuel-level plane2 fl1)
   goals met: 22 of 31
74. (debark person25 plane2 city2)
   deleted: (in person25 plane2)
   added: (at person25 city2)
   goals met: 23 of 31
75. (fly plane1 city4 city6 fl1 fl0)
   deleted: (at_aircraft plane1 city4) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city6) (fuel-level plane1 fl0)
   goals met: 23 of 31
76. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 23 of 31
77. (debark person27 plane1 city6)
   deleted: (in person27 plane1)
   added: (at person27 city6)
   goals met: 24 of 31
78. (board person21 plane1 city6)
   deleted: (at person21 city6)
   added: (in person21 plane1)
   goals met: 24 of 31
79. (board person15 plane1 city6)
   deleted: (at person15 city6)
   added: (in person15 plane1)
   goals met: 24 of 31
80. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   goals met: 25 of 31
81. (fly plane1 city6 city3 fl1 fl0)
   deleted: (at_aircraft plane1 city6) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city3) (fuel-level plane1 fl0)
   goals met: 25 of 31
82. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 25 of 31
83. (debark person21 plane1 city3)
   deleted: (in person21 plane1)
   added: (at person21 city3)
   goals met: 26 of 31
84. (fly plane1 city3 city4 fl1 fl0)
   deleted: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city4) (fuel-level plane1 fl0)
   goals met: 26 of 31
85. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 26 of 31
86. (debark person15 plane1 city4)
   deleted: (in person15 plane1)
   added: (at person15 city4)
   goals met: 27 of 31
87. (fly plane1 city4 city9 fl1 fl0)
   deleted: (at_aircraft plane1 city4) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city9) (fuel-level plane1 fl0)
   goals met: 27 of 31
88. (debark person19 plane1 city9)
   deleted: (in person19 plane1)
   added: (at person19 city9)
   goals met: 28 of 31
89. (debark person16 plane1 city9)
   deleted: (in person16 plane1)
   added: (at person16 city9)
   goals met: 29 of 31
90. (debark person13 plane1 city9)
   deleted: (in person13 plane1)
   added: (at person13 city9)
   goals met: 30 of 31
91. (fly plane2 city2 city9 fl1 fl0)
   deleted: (at_aircraft plane2 city2) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city9) (fuel-level plane2 fl0)
   goals met: 30 of 31
92. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 30 of 31
93. (board person17 plane1 city9)
   deleted: (at person17 city9)
   added: (in person17 plane1)
   goals met: 30 of 31
94. (fly plane1 city9 city2 fl1 fl0)
   deleted: (at_aircraft plane1 city9) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city2) (fuel-level plane1 fl0)
   goals met: 30 of 31
95. (debark person17 plane1 city2)
   deleted: (in person17 plane1)
   added: (at person17 city2)
   goals met: 31 of 31
